{
  "home": {
    "hello": "prazer, Renan 👋",
    "description": "Seja bem-vindo ao meu site pessoal. Sou engenheiro de software, atuando na maior parte do tempo com desenvolvimento web. Ainda não tem muita coisa por aqui 😅, mas eu estou trabalhando nisso...",
    "skills": {
      "description": "Aqui estão algumas das tecnologias que eu venho utilizando, seja no meu trabalho ou em projetos pessoais.",
      "list": [
        "Typescript",
        "React",
        "Next.js",
        "Go lang",
        "Docker",
        "Git",
        "TanStack/Query",
        "Jest",
        "Storybook"
      ]
    }
  },
  "work": {
    "title": "meu trabalho",
    "description": "Um resumo sobre a minha experiência profissional.",
    "experiences": [
      {
        "name": "Ingresso.com",
        "role": "Senior Software Engineer",
        "description": "A Ingresso.com é uma plataforma pioneira na venda de ingressos do Brasil, oferecendo uma ampla gama de ingressos para eventos, cinemas e shows. Desde 2020, atuo como a referência técnica para desenvolvedores front-end, liderando a implementação de novas funcionalidades, garantindo a manutenção e otimização da performance do site, e promovendo a adoção das melhores práticas em desenvolvimento web. Minha atuação inclui a coordenação técnica de projetos de alta complexidade, a mentoria de novos talentos e a colaboração estreita com equipes de UX/UI para assegurar a melhor experiência de usuário possível.",
        "list": [
          "Implementação de um novo fluxo de compra de ingressos para o Rock in Rio 2022, migrando o projeto legado feito em angular.js para um stack mais atual utilizando React, Next.js, Typescript e react-hook-form",
          "Desenvolvimento do product discovery da empresa, feito com React, Next.js, Typescript, React-Query, Storybook, zod e react-hook-form",
          "Realização de testes automatizados com Jest e Playwright, monitoria de erro com Sentry, garantia de qualidade com SonarQube e implementação de CI/CD com Github Actions"
        ]
      },
      {
        "name": "Fundação Getulio Vargas",
        "role": "Software Engineer",
        "description": "A Fundação Getulio Vargas é uma das mais importantes instituições de ensino e pesquisa do Brasil, onde eu tive a oportunidade de trabalhar na Diretoria de Análise de Políticas Públicas (FGV DAPP).",
        "list": [
          "Desenvolvimento do webapp 'observa2018' para o acompanhamento das eleições presidenciais do Brasil de 2018 nas redes sociais. O projeto foi um sucesso e foi destaque em vários veículos de comunicação. O projeto foi desenvolvido com vue.js e Express e contava com recursos de PWA e Push Notification, permitindo o acompanhamento em tempo real das menções dos candidatos nas redes sociais.",
          "Desenvolvimento de dashboards focados na análise de dados voltados para políticas públicas, utilizando javascript, d3.js.",
          "Reformulação do site institucional da diretoria, feito com wordpress e PHP.",
          "Implementação do design system da diretoria, além de diversos projetos internos."
        ]
      },
      {
        "name": "Sinapse tecnologias educacionais",
        "role": "Software Engineer",
        "description": "Sinapse é uma empresa que atua há mais de 30 anos no mercado de tecnologia educacional. Lá eu tive a oportunidade de trabalhar na implementação de sites para instituições de ensino."
      }
    ]
  },
  "blog": {
    "description": "Aqui você pode encontrar alguns posts sobre a minha jornada como engenheiro de software. Espero que goste."
  },
  "application": {
    "language": {
      "select": {
        "label": "Mudar idioma",
        "en": "🇺🇸 Inglês",
        "br": "🇧🇷 Português"
      }
    }
  }
}
